app/views/users/_user_stamp.html.erb

SELECT  1 AS one FROM "articles" WHERE "articles"."user_id" = ? LIMIT 1  [["user_id", 2]]
---
      <li>
        <small><%= user.articles.any? ? pluralize(user.articles.count, 'artykuł', 'artykuły') : '0 artykułów' %></small>