blog/app/views/articles/_form.html.erb

              <!--category_ids to nazwa kolekcji ktora to bedzie przesylalo-->
              <%= a.collection_check_boxes :category_ids, Category.all, :id, :name do |builder| %>
---
SELECT "categories".* FROM "categories"