blog/app/controllers/users_controller.rb

  def create
    @user = User.new(deserialize_user)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    if @user.update deserialize_user
---
UPDATE "users" SET "username" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "siusiak"], ["email", "penis@qwe.wp"], ["password_digest", "$2a$10$meuXxWT/PZMz4xZEiAxx1uYSajIm4SqrwvOdSvQtumGwf.6Bp6YiS"], ["updated_at", "2016-08-04 19:33:13.339255"], ["id", 5]]

  def find_user_by_id
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 7]]