blog/app/views/layouts/_navigation.html.erb

            <li role="separator" class="divider"></li>
            <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"