blog/app/views/categories/_category_row.html.erb

SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]
---
      <%= category.name %>
        &nbsp;<small><%= category.articles.count %></small>