app/controllers/articles_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "dupaaaa z userem"], ["description", "dla usera robiony etetests"], ["user_id", 1], ["created_at", "2016-08-01 19:56:18.491543"], ["updated_at", "2016-08-01 19:56:18.491543"]]
---
  def create
    #PRZYKLADOWA zawartość params
    #Parameters: {"utf8"=>"✓", "authenticity_token"=>"3mZMeLCMruSqWHuEJuVZB5kFQogWAxoSA3ueohyGWA4t3wQcWdDZSo+lYCv9jLtH+TzBYyOA1R7CBgSUB7Qh6A==", "article"=>{"title"=>"test123", "description"=>"asdasdasdasd"}, "commit"=>"Utwórz"}
    #{"utf8"=>"✓", "authenticity_token"=>"3mZMeLCMruSqWHuEJuVZB5kFQogWAxoSA3ueohyGWA4t3wQcWdDZSo+lYCv9jLtH+TzBYyOA1R7CBgSUB7Qh6A==", "article"=>{"title"=>"test123", "description"=>"asdasdasdasd"}, "commit"=>"Utwórz", "controller"=>"articles", "action"=>"create"}
    #p params
    #render plain: params[:article]

    @article = Article.new(article_parsed)
    @article.user = User.first
    if @article.save

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 2]]
---
  def destroy
    if (@article = Article.destroy(params[:id]))

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "drugi TERAZ SERIO"], ["description", "leeet 1337 asd"], ["updated_at", "2016-07-17 19:12:17.998585"], ["id", 12]]
---
  def update
    # set_article_param
    # chałupnicza metoda
    # article_parsed.each { |k, v| @article[k] = v }
    # if @article.save
    #   flash[:notice] = "Poprawnie zaktualizowano pozycję"
    # dobra metoda
    if @article.update article_parsed

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 12]]
---
  def set_article_param
    @article = Article.find(params[:id])