app/controllers/categories_controller.rb

  def show
    # params[:id] tez dziala require sprawdza na obecnosc
    @category = Category.find(params.require(:id))
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]