app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Testowa"], ["created_at", "2016-08-17 18:54:10.977570"], ["updated_at", "2016-08-17 18:54:10.977570"]]
---
  def create
    @category = Category.new(parse_category_params)
    if @category.save

SELECT  "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ? LIMIT 5 OFFSET 0  [["category_id", 2]]
SELECT COUNT(*) FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]
---
  def show
    # params[:id] tez dziala require sprawdza na obecnosc
    @articles = @category.articles.paginate(page: params[:page], per_page: 5)

UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Testowaaa"], ["updated_at", "2016-08-20 23:13:28.411422"], ["id", 1]]
---
  def update
    if @category.update parse_category_params