app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "qhr"]]
---
  def create
    # debugger zatrzymuje server w tym miejscu jak breakpoint i pozwala na dostep do
    # zmiennych srodowiskowych w konsoli serwera - ctrl + d pozwala kontynuowac prace

    # debugger

    user = User.find_by(email: params[:session][:email].downcase)